// Задача: вывести «A» 10 раз.
// for (let i = 0; i < 10; i++) {
//   console.log("A");
// }

// ✅ Правило: если нужно повторить действие — используй цикл. Копипаст — признак плохого кода.

// ================================= //

// Задача: числа от 100 до 1 в порядке убывания

// for (let i = 100; i >= 1; i--) {
//     console.log(i);
// }

// ✅ Правило: пишите цикл так, чтобы его назначение было понятно с первого взгляда.

// Инициализация и типы. Задача: факториал числа N.
// const n = Number(prompt('Число:'));
// let factorial = 1;
// for (let i = 1; i <= n; i++) {
//     factorial *= i;
// }
// console.log(factorial)

// console.log(factorial(5)); // 120 (1 × 2 × 3 × 4 × 5 = 120);

// ✅ Правила:
// • prompt() → всегда оборачивать в Number()
// • Накопитель суммы: 0, произведения: 1
// • Граница: i <= n чтобы включить n
// • Давайте переменным понятные имена

// ================================= //

// Бесконечный цикл в while. Задача: вывести числа от 1 до 100, кратные 7.
